Repository: jupiter248/Weblog
Catalog: Weblog.Infrastructure/Localization/Resources/Errors.*.resx
Languages: fa

# UNKNOWN_ERROR
source: An unknown error appeared
fa: خطا ناشناخته رخ داد

source: validation error
fa: خطا در اعتبار سنجی

# UNAUTHORIZED
source: Unauthorized error
fa: خطای ورود غیر مجاز

# INTERNAL_SERVER
source: Internal server error
fa: خطای داخلی سرور

source: Content not found
fa: مورد پیدا نشد

source: Article not found.
fa: مقاله پیدا نشد.

# ARTICLE_TITLE_REQUIRED
source: Title of article must have value.
fa: عنوان مقاله الزامی است.

# ARTICLE_ABOVE_TITLE_REQUIRED
source: Above title of article must have value.
fa: عنوان بالای مقاله باید مقدار داشته باشد.

# ARTICLE_ABOVE_TITLE_MAX_LENGTH
source: Above title of article can not be more than 150.
fa: عنوان بالای مقاله نمی‌تواند بیشتر از ۱۵۰ کاراکتر باشد.

# ARTICLE_BELOW_TITLE_REQUIRED
source: Below title of article must have value.
fa: عنوان پایین مقاله باید مقدار داشته باشد.

# ARTICLE_BELOW_TITLE_MAX_LENGTH
source: Below title of article can not be more than 150.
fa: عنوان پایین مقاله نمی‌تواند بیشتر از ۱۵۰ کاراکتر باشد.

# ARTICLE_TITLE_MAX_LENGTH
source: Title of article can not be more than 150.
fa: عنوان مقاله نمی‌تواند بیش از ۱۵۰ کاراکتر باشد.

# ARTICLE_DESCRIPTION_MAX_LENGTH
source: Description of article can not be more than 600.
fa: توضیحات مقاله نمی‌تواند بیش از ۶۰۰ کاراکتر باشد.

# ARTICLE_DESCRIPTION_REQUIRED
source: Description of article must have value.
fa: توضیحات مقاله الزامی است.

# ARTICLE_TEXT_REQUIRED
source: Text of article must have value.
fa: متن مقاله الزامی است.

source: Category not found.
fa: دسته‌بندی پیدا نشد.

# CATEGORY_NAME_REQUIRED
source: Category name is required.
fa: نام دسته‌بندی الزامی است.

# CATEGORY_NAME_MAX_LENGTH
source: Category name can not be more than 100.
fa: نام دسته‌بندی نمی‌تواند بیش از ۱۰۰ کاراکتر باشد.

# CATEGORY_DESCRIPTION_REQUIRED
source: Category description is required.
fa: توضیحات دسته‌بندی الزامی است.

# CATEGORY_DESCRIPTION_MAX_LENGTH
source: Category description can not be more than 500.
fa: توضیحات دسته‌بندی نمی‌تواند بیش از ۵۰۰ کاراکتر باشد.

# CATEGORY_INVALID_ENTITY_TYPE
source: Category parent entity type is invalid.
fa: نوع موجودیت والد دسته‌بندی نامعتبر است.

# COMMENT_PARENT_ID_INVALID
source: Parent id of comment is invalid.
fa: شناسه والد نظر نامعتبر است.

# COMMENT_DELETE_FORBIDDEN
source: You do not have access to delete this comment
fa: شما دسترسی حذف این نظر را ندارید.

# COMMENT_UPDATE_FORBIDDEN
source: You do not have access to update this comment.
fa: شما دسترسی ویرایش این نظر را ندارید.

# COMMENT_TEXT_REQUIRED
source: Text of comment must have value.
fa: متن نظر الزامی است.

# COMMENT_TEXT_MAX_LENGTH
source: Text of comment can not be more than 1000
fa: متن نظر نمی‌تواند بیش از ۱۰۰۰ کاراکتر باشد.

# COMMENT_ENTITY_TYPE_REQUIRED
source: Entity type of comment must have value.
fa: نوع موجودیت نظر الزامی است.

# COMMENT_ENTITY_TYPE_INVALID
source: Entity type of com1 is invalid.
fa: نوع موجودیت نظر نامعتبر است.

source: Contributor not found.
fa: مشارکت‌کننده پیدا نشد.

# CONTRIBUTOR_FIRST_NAME_REQUIRED
source: Contributor name must have value
fa: نام مشارکت‌کننده الزامی است.

# CONTRIBUTOR_LAST_NAME_REQUIRED
source: Contributor last name must have value
fa: نام خانوادگی مشارکت‌کننده الزامی است.

# CONTRIBUTOR_FIRST_NAME_LENGTH
source: Contributor first name must be between 2 and 100
fa: نام مشارکت‌کننده باید بین ۲ تا ۱۰۰ کاراکتر باشد.

# CONTRIBUTOR_LAST_NAME_LENGTH
source: Contributor last name must be between 2 and 100
fa: نام خانوادگی مشارکت‌کننده باید بین ۲ تا ۱۰۰ کاراکتر باشد.

# CONTRIBUTOR_DESCRIPTION_REQUIRED
source: Contributor description must have value
fa: توضیحات مشارکت‌کننده الزامی است.

# CONTRIBUTOR_DESCRIPTION_MAX_LENGTH
source: Contributor description can not be more than 800
fa: توضیحات مشارکت‌کننده نمی‌تواند بیش از ۸۰۰ کاراکتر باشد.

source: Event not found.
fa: رویداد پیدا نشد.

# EVENT_TITLE_REQUIRED
source: Event Title must have value.
fa: عنوان رویداد الزامی است.

# EVENT_TITLE_MAX_LENGTH
source: Event Title can not be more than 150.
fa: عنوان رویداد نمی‌تواند بیش از ۱۵۰ کاراکتر باشد.

# EVENT_ABOVE_TITLE_REQUIRED
source: Above title of event must have value.
fa: عنوان بالای رویداد باید مقدار داشته باشد.

# EVENT_ABOVE_TITLE_MAX_LENGTH
source: Above title of event can not be more than 150.
fa: عنوان بالای رویداد نمی‌تواند بیشتر از ۱۵۰ کاراکتر باشد.

# EVENT_BELOW_TITLE_REQUIRED
source: Below title of event must have value.
fa: عنوان پایین رویداد باید مقدار داشته باشد.

# EVENT_BELOW_TITLE_MAX_LENGTH
source: Below title of event can not be more than 150.
fa: عنوان پایین رویداد نمی‌تواند بیشتر از ۱۵۰ کاراکتر باشد.

# EVENT_DESCRIPTION_REQUIRED
source: Event description must have value.
fa: توضیحات رویداد الزامی است.

# EVENT_DESCRIPTION_MAX_LENGTH
source: Event description can not be more than 600
fa: توضیحات رویداد نمی‌تواند بیش از ۶۰۰ کاراکتر باشد.

# EVENT_CONTEXT_REQUIRED
source: Event Text must have value.
fa: متن رویداد الزامی است.

# EVENT_PLACE_REQUIRED
source: Event place must have value.
fa: محل برگزاری رویداد الزامی است.

# EVENT_PLACE_MAX_LENGTH
source: Event place ca not be more than 100
fa: محل برگزاری رویداد نمی‌تواند بیش از ۱۰۰ کاراکتر باشد.

# EVENT_CAPACITY_IS_FULL
source: the capacity of event is full
fa: ظرفیت رویداد تکمیل شده است.

# FAVORITE_ITEM_ALREADY_EXISTS
source: You already added this itme to the favorites
fa: این مورد قبلاً به لیست علاقه‌مندی‌ها اضافه شده است.

source: Favorite list not found
fa: لیست علاقه‌مندی‌ها پیدا نشد.

source: Favorite item not found.
fa: مورد علاقه‌مندی پیدا نشد.

# FAVORITE_DELETE_FORBIDDEN
source: You do not have access to delete this favorite list
fa: شما دسترسی حذف این لیست علاقه‌مندی را ندارید.

# FAVORITE_UPDATE_FORBIDDEN
source: You do not have access to update this favorite list
fa: شما دسترسی ویرایش این لیست علاقه‌مندی را ندارید.

# FAVORITE_LIST_NAME_REQUIRED
source: Favorite list name must have value
fa: نام لیست علاقه‌مندی الزامی است.

# FAVORITE_LIST_DESCRIPTION_REQUIRED
source: Favorite list description must have value
fa: توضیحات لیست علاقه‌مندی الزامی است.

# FAVORITE_LIST_NAME_MAX_LENGTH
source: Favorite list name can not be more than 100.
fa: نام لیست علاقه‌مندی نمی‌تواند بیش از ۱۰۰ کاراکتر باشد.

# FAVORITE_LIST_DESCRIPTION_MAX_LENGTH
source: Favorite list description can not be more than 400.
fa: توضیحات لیست علاقه‌مندی نمی‌تواند بیش از ۴۰۰ کاراکتر باشد.

# ALREADY_LIKED
source: You already liked this item.
fa: شما قبلا این مورد رو لایک کرده اید

source: Medium not found
fa: رسانه پیدا نشد.

# MEDIUM_PARENT_ID_INVALID
source: parent id of medium is invalid
fa: شناسه والد رسانه نامعتبر است.

# MEDIUM_FILE_INVALID
source: medium file is invalid.
fa: فایل رسانه نامعتبر است.

# MEDIUM_DELETE_FORBIDDEN
source: You do not have access to delete this medium
fa: شما دسترسی حذف این رسانه را ندارید.

# MEDIUM_NAME_MAX_LENGTH
source: Medium name can not be more than 80.
fa: نام رسانه نمی‌تواند بیش از ۸۰ کاراکتر باشد.

# MEDIUM_NAME_REQUIRED
source: Medium name must have value.
fa: نام رسانه الزامی است.

# MEDIUM_PATH_LENGTH
source: Medium path can not be more than 100.
fa: مسیر رسانه نمی‌تواند بیش از ۱۰۰ کاراکتر باشد.

# MEDIUM_PATH_REQUIRED
source: Medium path must have value.
fa: مسیر رسانه الزامی است.

# MEDIUM_ALT_TEXT_LENGTH
source: Medium alt text can not be more than 200
fa: متن جایگزین رسانه نمی‌تواند بیش از ۲۰۰ کاراکتر باشد.

# MEDIUM_ALT_TEXT_REQUIRED
source: Medium alt text must have value.
fa: متن جایگزین رسانه الزامی است.

# MEDIUM_FILE_REQUIRED
source: Medium file must have value.
fa: فایل رسانه الزامی است.

# MEDIUM_FILE_SIZE
source: Medium file size can not be more than 5MB.
fa: حجم فایل رسانه نمی‌تواند بیش از ۵ مگابایت باشد.

# MEDIUM_ENTITY_TYPE_INVALID
source: Medium entity type is invalid.
fa: نوع موجودیت رسانه نامعتبر است.

# MEDIUM_TYPE_INVALID
source: Medium type is invalid.
fa: نوع رسانه نامعتبر است.

source: Participant not found
fa: شرکت کننده پیدا نشد

# ALREADY_TOOK_PART
source: You already took part .
fa: شما قبلا در این رویداد شرکت کردید

source: Podcast not found.
fa: پادکست پیدا نشد.

# PODCAST_NAME_REQUIRED
source: Podcast name must have value.
fa: نام پادکست الزامی است.

# PODCAST_NAME_MAX_LENGTH
source: Podcast name can not be more than 100.
fa: نام پادکست نمی‌تواند بیش از ۱۰۰ کاراکتر باشد.

# PODCAST_DESCRIPTION_REQUIRED
source: Podcast description must have value4.
fa: توضیحات پادکست الزامی است.

# PODCAST_DESCRIPTION_MAX_LENGTH
source: Podcast description can not be more than 800.
fa: توضیحات پادکست نمی‌تواند بیش از ۸۰۰ کاراکتر باشد.

# PODCAST_LINK_REQUIRED
source: Podcast link must have value.
fa: لینک پادکست الزامی است.

# PODCAST_LINK_MAX_LENGTH
source: Podcast link can not be more than 300.
fa: لینک پادکست نمی‌تواند بیش از ۳۰۰ کاراکتر باشد.

# PODCAST_LINK_INVALID
source: Podcast link is invalid.
fa: لینک پادکست نامعتبر است.

source: Tag not found.
fa: تگ پیدا نشد.

# TAG_TITLE_REQUIRED
source: Tag title must have value.
fa: عنوان تگ الزامی است.

# TAG_TITLE_MAX_LENGTH
source: Tag title can not be more than 80.
fa: عنوان تگ نمی‌تواند بیش از ۸۰ کاراکتر باشد.

source: User not found
fa: کاربر پیدا نشد.

# INVALID_USERNAME
source: Username is invalid.
fa: نام کاربری نامعتبر است.

# INCORRECT_PASSWORD
source: Password is not correct
fa: رمز عبور صحیح نیست.

# ROLE_ASSIGN_FAILED
source: Role could not be assigned
fa: نقش کاربر قابل اختصاص نیست.

# USER_CREATE_FAILED
source: User could not have created
fa: کاربر قابل ایجاد نیست.

# PASSWORD_CHANGE_FAILED
source: Password could not be changed
fa: رمز عبور قابل تغییر نیست.

# USERNAME_REQUIRED
source: Username must have value.
fa: نام کاربری الزامی است.

# USERNAME_MAX_LENGTH
source: Username can not be more than 40.
fa: نام کاربری نمی‌تواند بیش از ۴۰ کاراکتر باشد.

# USER_FIRST_NAME_MAX_LENGTH
source: User first name must be between 2 and 50.
fa: نام کاربر باید بین ۲ تا ۵۰ کاراکتر باشد.

# USER_FIRST_NAME_REQUIRED
source: User first name must have value.
fa: نام کاربر الزامی است.

# USER_LAST_NAME_MAX_LENGTH
source: Username last name must be between 2 and 100.
fa: نام خانوادگی کاربر باید بین ۲ تا ۱۰۰ کاراکتر باشد.

# USER_LAST_NAME_REQUIRED
source: User last name must have value.
fa: نام خانوادگی کاربر الزامی است.

# PHONE_REQUIRED
source: Phone must have value.
fa: شماره تلفن الزامی است.

# INVALID_PHONE
source: Phone is invalid.
fa: شماره تلفن نامعتبر است.

# PASSWORD_REQUIRED
source: Password must have value.
fa: رمز عبور الزامی است.

# PASSWORD_LENGTH
source: Password must be between 8 and 100.
fa: رمز عبور باید بین ۸ تا ۱۰۰ کاراکتر باشد.
